# StairstypeConstructionMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeConstructionMethod Property
ParameterTypeId Class See Also
---
"Construction Method":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeConstructionMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeConstructionMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeConstructionMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace